{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "dtype": "float32", "filters": 32, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_1", "batch_input_shape": [null, 50, 50, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_regularizer": null, "filters": 32, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2d_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_constraint": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}]}